{
  "name": "АЛЕКСЕЙ БОРКОВСКИЙ",
  "lang": "Сменить язык на ",
  "objective": "Цель",
  "objective.text": "Подача заявки на позицию Frontend Developer (React, JS)",
  "aboutMe": "Обо мне",
  "portfolio": "Портфолио",
  "Summary": "Основное",
  "I am persistent. I love to improve my efficiency and functionality. I appreciate it when a scientific approach is at the heart of every case.": "Я настойчив, люблю улучшать свою эффективность и функциональность. Ценю, когда в основе каждого дела лежит научный подход.",
  "My Github": "Мой GitHub",
  "Professional interests:": "Профессиональные интересы:",
  "Skills": "Навыки",
  "Additionally": "Дополнительно",
  "English level certificate:": "Сертификат уровня английского языка:",
  "Work experience": "Опыт работы",
  "May 2022 - February 2023: I developed and taught my own online course \"IT-School: WEBSITE DEVELOPMENT BASICS\"": "Май 2022 - февраль 2023: разработал и вел собственный онлайн-курс «IT-School: ОСНОВЫ САЙТОСТРОЕНИЯ».",
  "You can see some of my projects in the \"Portfolio\" section of this resume.": "С некоторыми из моих проектов вы можете ознакомиться в разделе «Портфолио» данного резюме.",
  "You can find this and some of my other projects in the Portfolio section of this CV.": "С этим и  некоторыми другими  моими проектами вы можете ознакомиться в разделе «Портфолио» данного резюме.",
  "April 2020 - Today: I am self-taught web development.": "Апрель 2020 — cегодня: я изучаю веб-разработку самостоятельно",
  "2009 – 2022: Individual entrepreneur": "2009 – 2022: Индивидуальный предприниматель",
  "I worked under a commission agreement.": "Я работал по договору оказания услуг.",
  "Kind of activity": "Виды деятельности",
  "Position": "Должность",
  "trading agent": "торговый агент",
  "supervisor of the trading team": "супервайзер торговой команды",
  "2007-2009: Vladprodimport - distribution, wholesale": "Владпродимпорт - дистрибьюция, оптовые продажи",
  "2000 – 2007: Educator-psychologist, Smorgon Social and Pedagogical Center": "2000 – 2007: Педагог-психолог, Сморгонский социально-педагогический центр",
  "Education": "Образование",
  "April 2020 – today: Self-taught web development.": "Апрель 2020 – сегодня: Самостоятельно изучaю веб-разработку.",
  "Used sources": "Использованные источники",
  "YouTube course: ReactJS - The Samurai Way": "Курс YouTube: ReactJS — Путь самурая",
  "React official documentation": "Официальная документация React",
  "Online school materials Rolling Scopes": "Материалы онлайн школы Rolling Scopes",
  "Modern JavaScript Tutorial (\"learn.javascript.ru\")": "Современный учебник JavaScript (\"learn.javascript.ru\")",
  "And other": "И другие",
  "2021 - today: I'm learning English on my own with YouTube courses - English with playlists": "2021 - сегодня: Изучаю английский самостоятельно с помощью курсов YouTube - Английский по плейлистам",
  "August 2019 - March 2020: Studied, Educational Center for Programming and High Tech (IT-Academy)": "Август 2019 - март 2020: Обучался по программам Образовательного центра программирования и высоких технологий (IT-Academy)",
  "Courses": "Курсы",
  "Website development using HTML, CSS and JS": "Разработка веб-сайтов с использованием HTML, CSS and JS",
  "Development of web applications on Java Script": "Разработка веб-приложений на Java Script",
  "2000: Graduated from the Belarusian State Pedagogical University": "2000: Окончил Белорусский государственный педагогический университет.",
  "Faculty: Natural Science": "факультет естествознание",
  "Specialty": "Cпециальность",
  "Teacher of biology": "Учитель биологии",
  "Psychologist in educational institutions": "Психолог в учреждениях образования",
  "Military obligation status": "Статус военной обязанности",
  "I completed my compulsory military service in 2001-2002": "Я прошел срочную военную службу в 2001-2002 годах.",
  "All about frontend development": "Все о frontend-разработке",
  "A bit about the backend (I hope I like it too)": "Немного о бэкенде (надеюсь, мне он тоже понравится)",
  "YouTube: IT INCUBATOR | and many other resources": "YouTube: IT-INCUBATOR  | и множество других ресурсов",
  "and other": "и многое другое",
  "IT-School: WEBSITE DEVELOPMENT BASICS": "IT-School: «ОСНОВЫ САЙТОСТРОЕНИЯ»",
  "Online School: IT-School is my attempt to share basic knowledge on the topic of web development. Since my diploma profession is a teacher, I believe that I can make good courses for beginners. The first course of my project is the Fundamentals of Website Building. Now this project is frozen, but I want to return to it someday with new inspiration and new knowledge.*": "Онлайн-школа: IT-School — это моя попытка поделиться базовыми знаниями по теме веб-разработки. Поскольку моя дипломная профессия — учитель, я считаю, что смогу сделать хорошие курсы для начинающих. Первый курс моего проекта — «Основы сайтостроения». Сейчас этот проект заморожен, но я хочу когда-нибудь вернуться к нему с новым вдохновением и новыми знаниями.*",
  "The following skills and concepts were applied in the project": "В проекте были использованы следующие навыки и концепции",
  "a little React": "немного React",
  "a little Redux": "немного Redux",
  "a little HTML, CSS": "немного HTML и CSS",
  "a little Bootstrap": "немного Bootstrap",
  "a little pure JS": "немного чистого JS",
  "And a lot of my soul :)": "И много моей души :)",
  "* - I will be very happy if you visit YouTube or Boosty project. You can go to them from the business card site.": "* - Буду очень рад, если вы посетите YouTube или Boosty проекта. Перейти на них можно с сайта-визитки.",
  "Social Network": "Социальная сеть",
  "I used this project to get the knowledge needed to work with React.*": "Я использовал этот проект, чтобы получить знания, необходимые для работы с React.*",
  "Try editing your profile. Enter incorrect data in the forms.": "Попробуйте заполнить свой профиль. Введите некорректные данные в формы.",
  "*- At this stage of project development, adaptive design is not a priority. The project was used to teach React related concepts": "*- На данном этапе разработки проекта адаптивный дизайн не является приоритетом. Проект использовался для изучения концепций, связанных с React.",
  "RETOART - is my first work that I did completely by myself in February 2020. Everything from design to content was created by me. It was a real business card site for real-life photo retouchers.": "РЕТОАРТ - моя первая работа, которую я сделал полностью самостоятельно в феврале 2020 года. Все от дизайна до контента создано мной. Это был \"боевой\" сайт-визитка для реальных фоторетушеров.",
  "Hover your mouse over the photo retouching examples in the \"Услуги\" section to see an interesting animation solution on pure CSS. Change the width of the browser window to see how the site design changes.": "Наведите курсор мыши на примеры ретуши фотографий в разделе «Услуги», чтобы увидеть интересное решение анимации на чистом CSS. Измените ширину окна браузера, чтобы увидеть, как меняется дизайн сайта.",
  "Clock": "Часы",
  "This is a watch with synchronized analog and digital dials. If you download them in your browser on New Year's Eve, you will be in for a surprise.": "Это часы с синхронизированными аналоговым и цифровым циферблатами. Если вы загрузите их в свой браузер в новогоднюю ночь, вас ждет сюрприз.",
  "The watch brand is a link, by clicking on it you can see information about another project of their author :))": "Бренд часов - это ссылка, перейдя по ней можно увидеть информацию о другом проекте их автора :))",
  "Tic Tac Toe": "Крестики-нолики",
  "With the help of this game, I first got acquainted with React.*": "С помощью этой игры я впервые познакомился с React.*",
  "Check how correctly the game determines the winner. With move logging, you can always undo a move if you want.": "Проверьте, насколько правильно игра определяет победителя. С помощью журнала перемещений вы всегда можете отменить ход, если захотите.", 
  "* - The application works correctly only on the Desktop.": "* - Приложение корректно работает только на персональном компьютере.",
  "Calculator": "Калькулятор",
  "Pre-made spreadsheet layout livened up with calculator functionality*": "Готовый табличный макет оживлен  функционалом калькулятора",
  "It was very interesting to solve the problem of correct calculations with negative numbers and decimal fractions, raising a number to a power, extracting a square root.": "Было очень интересно добиться  правильных вычислений при операциях с отрицательными числами и десятичными дробями, возведением числа в степень, извлечением квадратного корня.",
  "* - Since the start layout is made in the form of a rigid table, the application is displayed correctly only on the desktop.": "* - Поскольку стартовый макет выполнен в виде жесткой таблицы, приложение корректно отображается только на персональном компьютере",
  "Fifteen Game": "Пятнашки",
  "This is the famous \"Fifteen\" puzzle, where the chips should be arranged sequentially from the chip with the smallest value to the chip with the largest value.*": "Это знаменитая головоломка «Пятнашки», в которой фишки следует расположить последовательно от фишки с наименьшим достоинством до фишки с наибольшим достоинством.*",
  "It was very interesting to implement that the chips were moved simultaneously by dragging and dropping and by clicking. It was also necessary to solve the problem so that the chips distributed randomly fell into the DOM only in a combination that can be solved.": "Было очень интересно реализовать программу, чтобы фишки перемещались одновременно перетаскиванием и щелчком. Также необходимо было решить задачу так, чтобы распределенные случайным образом фишки попадали в DOM только в той комбинации, которую можно решить."
}
